{
    "patents": [
        {
            "Assignee": "Topcon Corporation",
            "Title": "Slit lamp microscope, ophthalmic system, method of controlling slit lamp microscope, and recording medium ",
            "Date": "2025-05-13",
            "Abstract": "A slit lamp microscope of an aspect example includes a scanner, a controller, and an image set creation processor. The scanner is configured to scan an anterior segment of a subject's eye with slit light to collect an image group. The controller is configured to control the scanner to apply two or more scans to the anterior segment. The image set creation processor is configured to create an image set by selecting a series of images corresponding to a scan area from two or more image groups collected by the scanner in the two or more scans.",
            "URL": "https://patents.google.com/patent/US20250268470A1/en"
        },
        {
            "Assignee": "Topcon Corporation",
            "Title": "Ophthalmic apparatus and method of controlling same ",
            "Date": "2025-05-02",
            "Abstract": "An ophthalmic apparatus includes a light source, an illumination optical system, an optical scanner, an imaging optical system, and a controller. The illumination optical system generates slit-shaped illumination light. The optical scanner deflects the illumination light to guide the illumination light to a fundus of a subject's eye. The imaging optical system guides returning light of the illumination light from the fundus to an image sensor. The controller controls the image sensor using a rolling shutter method. The illumination optical system includes a slit-shaped aperture arranged at a position substantially conjugate optically to the fundus, an iris aperture arranged between the light source and the slit, and configured to be at a position substantially conjugate optically to an iris of the subject's eye; and an optical element arranged between the light source and the iris aperture, to deflect the light from the light source.",
            "URL": "https://patents.google.com/patent/US20250255483A1/en"
        },
        {
            "Assignee": "Topcon Corporation",
            "Title": "Ophthalmic apparatus, method of controlling the same, and recording medium ",
            "Date": "2025-04-28",
            "Abstract": "An ophthalmic apparatus of an aspect example applies optical coherence tomography (OCT) to an eye, and includes an interferometer, an OCT data generating unit, an optical path length changing unit, and a processing unit. The interferometer includes a measurement arm and a reference arm. The OCT data generating unit is configured to generate OCT data based on an output from the interferometer. The optical path length changing unit is configured to change at least one of the optical path length of the measurement arm and the optical path length of the reference arm. The processing unit is configured to control the optical path length changing unit to place partial data of the OCT data corresponding to a predetermined part of the eye at a standard depth level. The standard depth level is set based on a predetermined ocular parameter value.",
            "URL": "https://patents.google.com/patent/US20250268468A1/en"
        },
        {
            "Assignee": "Topcon Corporation",
            "Title": "Ophthalmic apparatus, method of controlling same, and recording medium ",
            "Date": "2025-04-22",
            "Abstract": "An ophthalmic apparatus includes an illumination optical system, optical scanner, imaging optical system, controller, and image forming unit. The imaging optical system guides returning light of the illumination light from the fundus to an image sensor. The image forming unit forms an image of the fundus based on a light receiving result captured in an imaging target region on a light receiving surface of the image sensor. The image sensor captures the light receiving result in an opening region on the light receiving surface using a rolling shutter method, the opening region corresponding to an illumination region of the illumination light on the fundus, the illumination region being moved in a predetermined scan direction by the optical scanner. The controller controls the optical scanner so that irradiation times of the returning light at a plurality of light receiving elements in the imaging target region are substantially equal.",
            "URL": "https://patents.google.com/patent/US20250241532A1/en"
        }
    ]
}