{
    "patents": [
        {
            "Title": "Transport container for holding several ophthalmic lens blanks for transport in a production facility ",
            "Date": "2025-05-12",
            "Abstract": "Transport container (10) for holding several ophthalmic lens blanks for transport in a production plant, the transport container (10) comprising:\n- a plurality of lens holders (12) for each receiving a spectacle lens blank, wherein the lens holders (12) each form a concave recess (14) into which one of the plurality of spectacle lens blanks can be inserted to receive the spectacle lens blank; characterized in that\n- the lens holders (12) are designed such that the concave depressions (14) have an increasing gradient radially outwards.",
            "URL": "https://patents.google.com/patent/DE202025102590U1/en"
        },
        {
            "Title": "Ink jet printing method of tinting a spectacle lens and tinted spectacle lens ",
            "Date": "2025-05-08",
            "Abstract": "An ink jet printing method of tinting a spectacle lens substrate includes providing a spectacle lens substrate having a front surface and a back surface, printing droplets of a first inkjet printing ink to form a first layer and droplets of a second inkjet printing ink to form a second layer, and curing the first layer and the second layer together in a combined curing step. The spectacle lens substrate can optionally be precoated. At least one inkjet printing ink is colored. The first layer and second layer each cover fully or partially the front surface and/or back surface, and at least partially overlap to form a stack. Moreover, a tinted spectacle lens having a non-linear color gradient, contoured di- or polychromatic pattern, contoured di- or polychromatic figure, di- or polychromatic alphabetic code, di- or polychromatic numerical code, di- or polychromatic alphanumerical code is disclosed.",
            "URL": "https://patents.google.com/patent/US20250264736A1/en"
        },
        {
            "Title": "Computer-implemented method for calculating a digital twin of a spectacle lens ",
            "Date": "2025-04-28",
            "Abstract": "A computer-implemented method for calculating a digital twin of a spectacle lens is provided to use the digital twin for a manufacture of the spectacle lens. The digital twin has a predefined power distribution and contains a layer stack with a plurality of individual layers, eac",
            "URL": "https://patents.google.com/patent/US20250251617A1/en"
        }
    ]
}